cases/70lltu12_sas_2d/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object	omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 60;

boundaryField
{
    BA
    {
        type            timeVaryingMappedFixedValue;
        setAverage      off;
        offset          0;
        //mapMethod       nearest;
    }

    CB
    {
        type            timeVaryingMappedFixedValue;
        setAverage      off;
        offset          0;
    }

    DC
    {
        type            zeroGradient;
    }

    AD
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

}

// ************************************************************************* //
