cases/70lltu12_sas_2d/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear; //leastSquares
}

// divSchemes
// {
//     default             none;

//     div(phi,U)          bounded Gauss linearUpwind grad;
//     div(phi,k)          bounded Gauss linearUpwind grad;
//     div(phi,omega)      bounded Gauss linearUpwind grad;

//     div((nuEff*dev2(T(grad(U))))) Gauss linear;
// }
divSchemes
{
    div(phi,U)                      Gauss linearUpwind default;
    div(phi,omega)                  Gauss linearUpwind default;
    div(phi,k)                      Gauss linearUpwind default;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
    correctWalls true;
}


// ************************************************************************* //
